Repository: icungse/SpendMind
Catalog: Veyra/Resources/Localizable.xcstrings
Source language: en
Languages: id

# general.cancel
source: Cancel
id: Batal

# general.delete
source: Delete
id: Hapus

# general.done
source: Done
id: Selesai

# general.save
source: Save
id: Simpan

# budget.accessibility.amount
source: Budget Amount
id: Jumlah Anggaran

# budget.accessibility.card
source: %@, %@, budget %@, spent %@, remaining %@, %@ used, status %@
id: %@, %@, anggaran %@, terpakai %@, tersisa %@, %@ digunakan, status %@

# budget.accessibility.category
source: Budget Category
id: Kategori Anggaran

# budget.accessibility.current_month
source: Current month, %@
id: Bulan ini, %@

# budget.accessibility.delete
source: Delete Budget
id: Hapus Anggaran

# budget.accessibility.dismiss_keyboard
source: Dismiss Keyboard
id: Tutup Keyboard

# budget.accessibility.edit
source: Edit %@
id: Ubah %@

# budget.accessibility.form.cancel
source: Cancel Budget Form
id: Batalkan Form Anggaran

# budget.accessibility.form.save
source: Save Budget
id: Simpan Anggaran

# budget.accessibility.month
source: Budget Month
id: Bulan Anggaran

# budget.accessibility.name
source: Budget Name
id: Nama Anggaran

# budget.accessibility.progress
source: %@, %@ used, status %@
id: %@, %@ digunakan, status %@

# budget.accessibility.summary.empty
source: Budget Summary. No budgets yet. Create a budget to track monthly spending.
id: Ringkasan Anggaran. Belum ada anggaran. Buat anggaran untuk melacak pengeluaran bulanan.

# budget.accessibility.summary.loaded
source: Budget Summary. Total budget %@. Total spent %@. Remaining %@. Overall progress %@. %@. %@.
id: Ringkasan Anggaran. Total anggaran %@. Total terpakai %@. Tersisa %@. Progres keseluruhan %@. %@. %@.

# budget.accessibility.summary.opens_list
source: Opens budget list
id: Membuka daftar anggaran

# budget.accessibility.threshold
source: Budget Alert Threshold
id: Batas Peringatan Anggaran

# budget.accessibility.type
source: Budget Type
id: Jenis Anggaran

# budget.accessibility.validation_error
source: Validation Error : %@
id: Kesalahan Validasi : %@

# budget.alert_settings
source: Alert Settings
id: Pengaturan Peringatan

# budget.alert_threshold
source: Alert Threshold
id: Batas Peringatan

# budget.alert_threshold.label
source: Alert at %lld%%
id: Peringatan pada %lld%%

# budget.alert_state.persistence.fetch_failed
source: Failed to fetch budget alert state : %@
id: Gagal mengambil status peringatan anggaran : %@

# budget.alert_state.persistence.save_failed
source: Failed to %@ budget alert state : %@
id: Gagal %@ status peringatan anggaran : %@

# budget.already_budgeted
source: Already budgeted
id: Sudah dianggarkan

# budget.amount
source: Amount
id: Jumlah

# budget.category
source: Category Budget
id: Anggaran Kategori

# budget.category_budgets
source: Category Budgets
id: Anggaran Kategori

# budget.confirm_delete
source: Confirm delete before continuing.
id: Konfirmasi penghapusan sebelum melanjutkan.

# budget.create
source: Create Budget
id: Buat Anggaran

# budget.delete
source: Delete Budget
id: Hapus Anggaran

# budget.delete.confirmation.message
source: Your expenses will not be deleted.
id: Pengeluaran Anda tidak akan dihapus.

# budget.delete.confirmation.title
source: Delete this budget?
id: Hapus anggaran ini?

source: Budget Details
id: Detail Anggaran

# budget.edit
source: Edit Budget
id: Ubah Anggaran

# budget.empty.create_first.message
source: Set a monthly spending limit and track your progress throughout the month.
id: Tetapkan batas pengeluaran bulanan dan lacak progres sepanjang bulan.

# budget.empty.create_first.title
source: Create your first budget
id: Buat anggaran pertama Anda

# budget.empty.insights.message
source: Create a budget or add expenses this month to see insights.
id: Buat anggaran atau tambah pengeluaran bulan ini untuk melihat insight.

# budget.empty.insights.title
source: No budget insights yet
id: Belum ada insight anggaran

# budget.empty.summary.message
source: Create a budget to track monthly spending.
id: Buat anggaran untuk melacak pengeluaran bulanan.

# budget.exceeded
source: Exceeded
id: Terlampaui

# budget.form.type.category
source: Specific category
id: Kategori tertentu

# budget.form.type.total
source: Total Spending
id: Total Pengeluaran

# budget.insight.category_approaching_limit
source: Your %@ budget is close to its limit.
id: Anggaran %@ mendekati batasnya.

# budget.insight.category_budgets_exceeded
source: You have exceeded %lld category budgets this month.
id: %lld anggaran kategori terlampaui bulan ini.

# budget.insight.overall_monthly_progress
source: You have used %lld%% of your monthly budget with %lld days remaining.
id: Anda telah menggunakan %lld%% anggaran bulanan dengan %lld hari tersisa.

source: Budget Insights
id: Insight Anggaran

# budget.load.failed
source: Could not load budgets
id: Tidak dapat memuat anggaran

# budget.loading
source: Loading Budgets...
id: Memuat Anggaran...

# budget.monthly
source: Monthly Budget
id: Anggaran Bulanan

# budget.name
source: Name
id: Nama

source: Budget Notifications
id: Notifikasi Anggaran

# budget.notifications.body
source: One of your budgets needs attention.
id: Salah satu anggaran Anda perlu diperhatikan.

# budget.notifications.exceeded.title
source: Budget exceeded
id: Anggaran terlampaui

# budget.notifications.warning.title
source: Budget warning
id: Peringatan anggaran

# budget.over_budget
source: %@ over budget
id: %@ melebihi anggaran

# budget.period.monthly
source: Monthly
id: Bulanan

# budget.persistence.action.fetch_active_budgets
source: fetch active budgets
id: mengambil anggaran aktif

# budget.persistence.action.fetch_budgets_by_date_range
source: fetch budgets by date range
id: mengambil anggaran berdasarkan rentang tanggal

# budget.persistence.action_failed
source: Failed to %@ : %@
id: Gagal %@ : %@

# budget.persistence.category_fetch_failed
source: Failed to fetch budget category : %@
id: Gagal mengambil kategori anggaran : %@

# budget.persistence.fetch_failed
source: Failed to fetch budget : %@
id: Gagal mengambil anggaran : %@

# budget.persistence.load_failed
source: Failed to load budget : %@
id: Gagal memuat anggaran : %@

# budget.persistence.save_failed
source: Failed to %@ budget : %@
id: Gagal %@ anggaran : %@

# budget.persistence.uniqueness_failed
source: Failed to validate budget uniqueness : %@
id: Gagal memvalidasi keunikan anggaran : %@

# budget.remaining
source: Remaining
id: Tersisa

# budget.remaining.left
source: %@ left
id: %@ tersisa

# budget.safe
source: Safe
id: Aman

# budget.select_category
source: Select Category
id: Pilih Kategori

# budget.spent
source: Spent
id: Terpakai

# budget.spent.value
source: %@ spent
id: %@ terpakai

source: Budget Summary
id: Ringkasan Anggaran

# budget.summary.current_month
source: Current month
id: Bulan ini

# budget.summary.exceeded_count
source: %lld budgets exceeded
id: %lld anggaran terlampaui

# budget.summary.no_budgets_yet
source: No budgets yet
id: Belum ada anggaran

# budget.summary.total_budget
source: Total budget
id: Total anggaran

# budget.summary.total_spent
source: Total spent
id: Total terpakai

# budget.summary.warning_count
source: %lld budgets in warning
id: %lld anggaran dalam peringatan

# budget.title
source: Budget
id: Anggaran

# budget.title_plural
source: Budgets
id: Anggaran

# budget.total_monthly
source: Total Monthly Budget
id: Total Anggaran Bulanan

# budget.total_spending
source: Total Spending
id: Total Pengeluaran

# budget.total.active_budgets
source: All active budgets
id: Semua anggaran aktif

# budget.try_again
source: Try again.
id: Coba lagi.

source: Budget Type
id: Jenis Anggaran

# budget.update
source: Update Budget
id: Perbarui Anggaran

# budget.used
source: %@ used
id: %@ digunakan

# budget.validation.active_duplicate
source: An active budget already exists for this category and period.
id: Anggaran aktif sudah ada untuk kategori dan periode ini.

# budget.validation.alert_threshold_range
source: Budget alert threshold must be between 0 and 1.
id: Batas peringatan anggaran harus antara 0 dan 1.

# budget.validation.alert_threshold_valid
source: Alert threshold must be valid.
id: Batas peringatan harus valid.

# budget.validation.amount_greater_than_zero
source: Budget amount must be greater than zero.
id: Jumlah anggaran harus lebih dari nol.

# budget.validation.amount_greater_than_zero_short
source: Amount must be greater than zero.
id: Jumlah harus lebih dari nol.

# budget.validation.amount_required
source: Amount is required.
id: Jumlah wajib diisi.

# budget.validation.amount_valid_number
source: Amount must be a valid number.
id: Jumlah harus berupa angka yang valid.

# budget.validation.category_active_duplicate
source: Category already has an active budget for this month.
id: Kategori sudah memiliki anggaran aktif untuk bulan ini.

# budget.validation.category_required
source: Category is required.
id: Kategori wajib dipilih.

# budget.validation.invalid_month
source: Invalid budget month.
id: Bulan anggaran tidak valid.

# budget.validation.invalid_date_range
source: Invalid budget date range.
id: Rentang tanggal anggaran tidak valid.

# budget.validation.invalid_end_date
source: Invalid budget end date.
id: Tanggal akhir anggaran tidak valid.

# budget.validation.name_required
source: Budget name is required.
id: Nama anggaran wajib diisi.

# budget.validation.not_found
source: Budget not found.
id: Anggaran tidak ditemukan.

# budget.warning
source: Warning
id: Peringatan

# budget.warning.exceeded_message
source: %@ is exceeded by %@.
id: %@ terlampaui sebesar %@.

# budget.warning.monthly_exceeded
source: Monthly budget is exceeded by %@.
id: Anggaran bulanan terlampaui sebesar %@.

# budget.warning.monthly_near_limit
source: Monthly budget is near its limit. %@ remains.
id: Anggaran bulanan mendekati batas. %@ tersisa.

# budget.warning.threshold_message
source: You've used %@ of %@. %@ remains.
id: Anda telah menggunakan %@ dari %@. %@ tersisa.
